app/controllers/session_controller.rb

  def create
    user = User.find_by(username: params[:login])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "lera"], ["LIMIT", 1]]